Revit 2027 API
FamilyParameter.IsReadOnly Property
Identifies if the object is read-only or modifiable.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public override bool IsReadOnly { get; }
Public Overrides ReadOnly Property IsReadOnly As Boolean
	Get
public:
virtual property bool IsReadOnly {
	bool get () override;
}
abstract IsReadOnly : bool with get
override IsReadOnly : bool with get
Property Value
Boolean
If true, the object may not be modified. If false, the object's contents may be modified.
See Also
Reference
FamilyParameter Class
Autodesk.Revit.DB Namespace